---
kind: other
id: Methods.T:Autodesk.Revit.UI.DockablePaneState
source: html/b31b4fc4-b65f-ce11-8bc1-3ebc04f2dc6b.htm
---
# DockablePaneState Methods

When %dockPosition% is Floating, sets the rectangle used to determine the size and position of the pane when %dockPosition% is Floating. Coordinates are relative to the upper-left-hand corner of the main Revit window.